---
kind: property
id: P:Autodesk.Revit.DB.Visual.Asset.LibraryName
source: html/1d2c7367-6db3-bfd6-57b8-37827f5156b4.htm
---
# Autodesk.Revit.DB.Visual.Asset.LibraryName Property

Library name

## Syntax (C#)
```csharp
public string LibraryName { get; }
```